Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/reference/checklists/checklist_when_complaining.html.txt.tmx
Source language: en
Languages: ga

source: When you buy goods or services in Ireland or another EU Member State you are protected by consumer legislation
ga: Nuair a cheannaíonn tú earraí nó seirbhísí in Éirinn nó i mBallstát eile an AE tá cosaint agat ó reachtaíocht tomhaltóirí

source: If your consumer rights are not being honoured you will need to complain and sometimes it can be difficult to know what to do if something goes wrong
ga: Mura bhfuil maith á dhéanamh de do chearta tomhaltóirí beidh ort gearán a dhéanamh agus bíonn sé deacair uaireanta fios a bheith agat cad ba cheart a dhéanamh má théann aon rud in aimhréidh

source: • Follow the retailer's or service provider's complaints process
ga: • Abair go soiléir an méid atá tú ag iarraidh a rá

source: You can find examples of complaint template letters on the Competition and Consumer Protection Commission (CCPC) website
ga: • Éist leis an méid atá le rá ag an miondíoltóir chun míthuiscintí a sheachaint

source: • Know your consumer rights and refer to consumer legislation
ga: • Bíodh a fhios agat cad atá tú ag iarraidh a bhaint amach

source: • If you have exhausted the complaints process and you are not satified with the outcome contact the CCPC for advice
ga: • Smaoinigh ar na hiarmhairtí

source: • At any point during your complaint you can contact the CCPC or a Citizens Information Centre or the Citizens Information Phone Service for advice
ga: • Ná téigh thar fóir- ní bhfaighidh tú an lámh in uachtar i gcónaí
